#Дано целое число, большее 999. Используя одну операцию деления нацело и одну операцию взятия остатка от деления, найти цифру, соответствующую разряду сотен в записи этого числа.
number = input("Введите целое число больше 999: ")
while type(number) != int:
    try:
        number = int(number)

    except ValueError:
        print("Неправильно ввели!!!")
        number = int(input("Введите целое число больше 999: "))

hundred = (number // 100) % 10
print("Цифра, соответствующая разряду сотен равна", hundred)



