#Дано целое число, большее 999. Используя одну операцию деления нацело и одну операцию взятия остатка от деления, найти цифру, соответствующую разряду сотен в записи этого числа.
number = input("Введите целое число больше 999: ")
while True:
    try:
        number = int(number)
        if number > 999:
            break
        print("Введите целое число больше 999!!!")
        number = input("Введите целое число больше 999: ")
    except ValueError:
        print("Ввели не число!!!")
        number = int(input("Введите целое число больше 999: "))

hundred = (number // 100) % 10
print("Цифра, соответствующая разряду сотен равна", hundred)



